# Install all dependencies with: brew bundle
# Usage: brew bundle [--file=Brewfile]

# ============================================
# Core Tools
# ============================================
brew "git"
brew "gh"
brew "gnupg"
brew "ripgrep"
brew "glances"
brew "htop"
brew "nethogs"
brew "node"
brew "nvm"
brew "pnpm"
brew "wget"
brew "zsh"
# brew "tailscale"

if OS.mac?
    # brew "mactop"
    # brew "appcleaner"
end

# ============================================
# Shell Enhancements
# ============================================
brew "antidote"
brew "asciiquarium"
brew "bat"
brew "htop"
brew "nerdfetch"
brew "onefetch"
brew "starship"
brew "tree"

# ============================================
# Productivity Tools
# ============================================
if OS.mac?
    # cask "ghostty"
    # cask "yaak"
    # cask "utm"
    # cask "github"
    # cask "visual-studio-code"
    # cask "1password"
    # cask "1password-cli"
    # cask "tailscale-app"
    # cask "protonvpn"
end

# ============================================
# AI Tools
# ============================================
if OS.mac?
    # cask "cursor"
    # cask "chatgpt"
    # cask "codex"
    # cask "codex-app"
    # cask "claude"
    # cask "claude-code"
    # brew "opencode"
end
