# Install all dependencies with: brew bundle
# Usage: brew bundle [--file=Brewfile]

# ============================================
# Core Tools
# ============================================
brew "wget"
brew "git"
brew "node"
brew "nvm"

# ============================================
# Shell Enhancements
# ============================================
brew "htop"
brew "bat"
brew "tree"
brew "asciiquarium"
brew "nerdfetch"
brew "onefetch"
brew "antidote"
brew "starship"

# ============================================
# Productivity Tools
# ============================================
cask "ghostty"
cask "visual-studio-code"
cask "1password"
cask "tailscale-app"
cash "protonvpn"

# ============================================
# AI Tools
# ============================================
# cask "cursor"
cask "chatgpt"
cask "codex"
cask "codex-app"
cask "claude"
cask "claude-code"
