# Optional dependencies. `homebrew/brew.sh` prompts for each entry.
# Supported entry types: brew, cask, tap, mas.

# Cross-platform
cask "1password-cli"
cask "claude-code"
cask "codex"
brew "opencode"
brew "tailscale"

# macOS Apps
if OS.mac?
    cask "1password"
    cask "appcleaner"
    cask "brave-browser"
    cask "chatgpt"
    cask "claude"
    cask "codex-app"
    cask "comet"
    cask "cursor"
    cask "docker-desktop"
    cask "firefox"
    cask "ghostty"
    cask "github"
    cask "google-chrome"
    brew "mactop"
    cask "obsidian"
    cask "opencode-desktop"
    cask "protonvpn"
    cask "tailscale-app"
    cask "utm"
    cask "visual-studio-code"
    cask "yaak"
end
