# Install all dependencies with: brew bundle
# Usage: brew bundle [--file=Brewfile]

# ============================================
# Core Tools
# ============================================
brew "git"
brew "glances"
brew "htop"
brew "mactop"
brew "nethogs"
brew "node"
brew "nvm"
brew "pnpm"
brew "wget"
brew "zsh"

# ============================================
# Shell Enhancements
# ============================================
brew "antidote"
brew "asciiquarium"
brew "bat"
brew "htop"
brew "nerdfetch"
brew "onefetch"
brew "starship"
brew "tree"

# ============================================
# Productivity Tools
# ============================================
cask "ghostty"
# cask "github"
# cask "visual-studio-code"
# cask "1password"
# cask "tailscale-app"
# cask "protonvpn"
# cask "utm"

# ============================================
# AI Tools
# ============================================
# cask "cursor"
# cask "chatgpt"
# cask "codex"
# cask "codex-app"
# cask "claude"
# cask "claude-code"
